---
kind: property
id: P:Autodesk.Revit.DB.Family.StructuralCodeName
zh: 族
source: html/f17d5d2b-e799-947f-8c19-2fd56c55b426.htm
---
# Autodesk.Revit.DB.Family.StructuralCodeName Property

**中文**: 族

The family's structural code name.

## Syntax (C#)
```csharp
public string StructuralCodeName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null